void main() {
  // double narx = 25.5;
  // print(narx);

  // double harorat = 13.7;
  // print(harorat);
  // double manfi = 12.8;
  // print(manfi);

  // double butun = 10;
  // print(butun);

  // Амалҳои арифметикӣ бо double

  double a = 10.2;
  double b = 4.5;

  print(a + b);
  print(a - b);
  print(a * b);
  print(a / b);

  //----------------------------------------------------------------------------

  //                                Вазифаи хонагӣ

  // 1.  **Эълон кардани `double`**
  // - Якчанд тағйирёбандаи `double` бо арзишҳои гуногун эълон кунед (масалан,
  // нархи маҳсулот, ҳарорати ҳаво, вазни шахс…).
  // - Онҳоро дар `console` чоп кунед.

  // 1. **Истифодаи амалҳои арифметикӣ**
  // - Ду адади `double` гиред ва онҳоро ҷамъ, тарҳ, зарб, тақсим кунед.
  // - Натиҷаҳоро дар `console` чоп кунед.
}
