void main() {
  // Усули оддӣ (List-и оддӣ)
  // List ruyxat = ["Mujbali", "Temiraliyev", 2003];
  // print(ruyxat);

  // Эълон кардани List-и холӣ ва илова кардани элементҳо
  // List raqamho = [];

  // raqamho.add(10);
  // raqamho.add("Raqam");
  // print(raqamho);

  //-----------------------------------------------------------------------------
  //                                Вазифаи хонагӣ
  //    1) List эълон кунед:
  //       List эълон кунед, ки номҳои дӯстони шуморо нигоҳ медорад.
  //       Баъд ба он якчанд ном илова кунед ва онро дар консол чоп кунед.

  // Рӯйхати номҳои дӯстон
  // List duston = [];

  // // // Номҳо илова кардан
  // duston.add("Али");
  // duston.add("Муҳаммад");
  // duston.add("Саид");

  // // Чоп кардани рӯйхати номҳо
  // print("Номҳои дӯстон: $duston");

  //  2) List-и рақамҳо эълон кунед:
  //     List-и рақамҳо эълон кунед, ки холҳои шумо дар имтиҳонро нигоҳ медорад.
  //     Ба он якчанд хол илова кунед ва онро дар консол чоп кунед..

  // Рӯйхати холҳои имтиҳон
  // List ballho = [];

  // // Ball-ро илова кардан
  // ballho.add(85);
  // ballho.add(90);
  // ballho.add(78);

  // // Чоп кардани рӯйхати холҳо
  // print("Холҳои имтиҳон: $ballho");
}
